In [1]:
import pandas as pd

In [2]:
actor=pd.read_csv('../data/actor.csv')
category=pd.read_csv('../data/category.csv')
film=pd.read_csv('../data/film.csv')
inventory=pd.read_csv('../data/inventory.csv')
language=pd.read_csv('../data/language.csv')
old_HDD=pd.read_csv('../data/old_HDD.csv')
rental=pd.read_csv('../data/rental.csv')

# Limpieza columna actor

In [3]:
nan_cols = actor.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [4]:
actor.last_update.value_counts()

2006-02-15 04:34:33    200
Name: last_update, dtype: int64

In [5]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
actor = actor.drop(['last_update'], axis=1)

In [6]:
#Cambiamos el formato ya que nos aparecían todas las letras en mayúsculas
actor.first_name = actor.first_name.str.capitalize()
actor.last_name = actor.last_name.str.capitalize()

In [7]:
#comprobamos si existen actores duplicados
actor[['first_name','last_name']].duplicated().sum()

1

In [8]:
# Eliminamos el registro duplicado y corregimos índices
act_index = actor[actor[['first_name','last_name']].duplicated()].index
actor = actor.drop(index= act_index).reset_index(drop= True)

In [9]:
actor.head()

   actor_id first_name     last_name
0         1   Penelope       Guiness
1         2       Nick      Wahlberg
2         3         Ed         Chase
3         4   Jennifer         Davis
4         5     Johnny  Lollobrigida

# Limpieza columna category

In [10]:
nan_cols = category.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [11]:
category.last_update.value_counts()

2006-02-15 04:46:27    16
Name: last_update, dtype: int64

In [12]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
category = category.drop(['last_update'], axis=1)

In [13]:
category.head(16)

    category_id         name
0             1       Action
1             2    Animation
2             3     Children
3             4     Classics
4             5       Comedy
5             6  Documentary
6             7        Drama
7             8       Family
8             9      Foreign
9            10        Games
10           11       Horror
11           12        Music
12           13          New
13           14       Sci-Fi
14           15       Sports
15           16       Travel

# Limpieza columna film

In [14]:
nan_cols = film.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

original_language_id    100.0
dtype: float64

In [15]:
#eliminamos la columna de 'original_language_id' ya que está llena de nulos
film = film.drop(['original_language_id'], axis=1)

In [16]:
film.release_year.value_counts()

2006    1000
Name: release_year, dtype: int64

In [17]:
film.last_update.value_counts()

2006-02-15 05:03:42    1000
Name: last_update, dtype: int64

In [18]:
film.language_id.value_counts()

1    1000
Name: language_id, dtype: int64

In [19]:
#eliminamos la columna de 'release_year' ya que todas las películas son del 2006.
film = film.drop(['release_year'], axis=1)

In [20]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
film = film.drop(['last_update'], axis=1)

In [21]:
# 1 equivale a English, de la tabla id_language, todas las películas son en inglés
film['language_id'].replace(1, 'English', inplace= True)

In [22]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,English,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,English,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,English,6,2.99,130,22.99,G,Deleted Scenes

# Limpieza columna inventory

In [23]:
nan_cols = inventory.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [24]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
inventory = inventory.drop(['last_update'], axis=1)

In [25]:
inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

# Limpieza columna language

In [26]:
nan_cols = language.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [27]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
language = language.drop(['last_update'], axis=1)

In [28]:
language.head()

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French

# Limpieza columna old_HDD

In [29]:
nan_cols = old_HDD.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [30]:
#eliminamos la columna de 'release_year' ya que todas son del mismo año
old_HDD = old_HDD.drop(['release_year'], axis=1)

In [31]:
#Cambiamos el formato ya que nos aparecían todas las letras en mayúsculas
old_HDD.first_name = old_HDD.first_name.str.capitalize()
old_HDD.last_name = old_HDD.last_name.str.capitalize()

In [32]:
old_HDD.head(15)

   first_name last_name                  title  category_id
0    Penelope   Guiness       ACADEMY DINOSAUR            6
1    Penelope   Guiness   ANACONDA CONFESSIONS            2
2    Penelope   Guiness            ANGELS LIFE           13
3    Penelope   Guiness  BULWORTH COMMANDMENTS           10
4    Penelope   Guiness          CHEAPER CLYDE           14
5    Penelope   Guiness     COLOR PHILADELPHIA            4
6    Penelope   Guiness        ELEPHANT TROJAN           11
7    Penelope   Guiness    GLEAMING JAWBREAKER           15
8    Penelope   Guiness         HUMAN GRAFFITI           10
9    Penelope   Guiness         KING EVOLUTION            8
10   Penelope   Guiness             LADY STAGE           11
11   Penelope   Guiness        LANGUAGE COWBOY            3
12   Penelope   Guiness       MULHOLLAND BEAST            9
13   Penelope   Guiness       OKLAHOMA JUMANJI           13
14   Penelope   Guiness            RULES HUMAN           11

# Limpieza columna rental

In [33]:
nan_cols = rental.isna().mean() * 100  # porcentaje de nulo en cada columna
nan_cols[nan_cols>0]

Series([], dtype: float64)

In [34]:
#eliminamos la columna de 'last_update' ya que todas las filas tienen la misma fecha
rental = rental.drop(['last_update'], axis=1)

In [35]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

# Reorganización de tablas

In [36]:
#para trabajar con el menor número de tablas, añadimos la categoría a old_HDD
old_HDD = old_HDD.merge(category, left_on='category_id', right_on='category_id', how='left')

In [37]:
old_HDD.columns = ['first_name','last_name','title','category_id', 'category']

In [38]:
old_HDD.head()

  first_name last_name                  title  category_id     category
0   Penelope   Guiness       ACADEMY DINOSAUR            6  Documentary
1   Penelope   Guiness   ANACONDA CONFESSIONS            2    Animation
2   Penelope   Guiness            ANGELS LIFE           13          New
3   Penelope   Guiness  BULWORTH COMMANDMENTS           10        Games
4   Penelope   Guiness          CHEAPER CLYDE           14       Sci-Fi

In [39]:
# #vamos a añadir las categorías de cada película a través de old_HDD
film = film.merge(old_HDD, on='title', how='left')
film = film.drop(['first_name', 'last_name'], axis=1)

# #eliminamos los duplicados que hayan podido salir con el join
film = film.drop_duplicates()

In [40]:
# #eliminamos la columna de 'category_id', con tener el nombre la categoría es suficiente
film = film.drop(['category'], axis=1)

In [41]:
# film['category_id'] = film['category_id'].fillna()

In [42]:
# film['category_id'] = film['category_id'].astype(int)

IntCastingNaNError: Cannot convert non-finite values (NA or inf) to integer

In [43]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11.0
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,English,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6.0
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,English,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",NaN
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,English,6,2.99,130,22.99,G,Deleted Scenes,NaN

In [44]:
len(film['title'])

1000

In [45]:
len(rental['rental_id'])

1000

In [46]:
rental.head(30)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1
5,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1
6,7,2005-05-24 23:11:53,3995,269,2005-05-29 20:34:53,2
7,8,2005-05-24 23:31:46,2346,239,2005-05-27 23:33:46,2
8,9,2005-05-25 00:00:40,2580,126,2005-05-28 00:22:40,1
9,10,2005-05-25 00:02:21,1824,399,2005-05-31 22:44:21,2
10,11,2005-05-25 00:09:02,4443,142,2005-06-02 20:56:02,2
11,12,2005-05-25 00:19:27,1584,261,2005-05-30 05:44:27,2
12,13,2005-05-25 00:22:55,2294,334,2005-05-30 04:28:55,1
13,14,2005-05-25 00:31:15,2701,446,2005-05-26 02:56:15,1
14,15,2005-05-25 00:39:22,3049,319,2005-06-03 03:30:22,1
15,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2
16,17,2005-05-25 01:06:36,830,575,2005-05-27 00:43:36,1
17,18,2005-05-25 01:10:47,3376,19,2005-05-31 06:35:47,2
18,19,2005-05-25 01:17:24,1941,456,2005-05-31 06:00:24,1
19,20,2005-05-25 01:48:41,3517,185,2005-05-27 02:20:41,2
20,21,2005-05-25 01:59:46,146,388,2005-05-26 01:01:46,2
21,22,2005-05-25 02:19:23,727,509,2005-05-26 04:52:23,2
22,23,2005-05-25 02:40:21,4441,438,2005-05-29 06:34:21,1
23,24,2005-05-25 02:53:02,3273,350,2005-05-27 01:15:02,1
24,25,2005-05-25 03:21:20,3961,37,2005-05-27 21:25:20,2
25,26,2005-05-25 03:36:50,4371,371,2005-05-31 00:34:50,1
26,27,2005-05-25 03:41:50,1225,301,2005-05-30 01:13:50,2
27,28,2005-05-25 03:42:37,4068,232,2005-05-26 09:26:37,2
28,29,2005-05-25 03:47:12,611,44,2005-05-30 00:31:12,2
29,30,2005-05-25 04:01:32,3744,430,2005-05-30 03:12:32,1

In [47]:
rental = rental[rental['inventory_id'] <= 1000]

In [48]:
rental.head(20)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
15,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2
16,17,2005-05-25 01:06:36,830,575,2005-05-27 00:43:36,1
20,21,2005-05-25 01:59:46,146,388,2005-05-26 01:01:46,2
21,22,2005-05-25 02:19:23,727,509,2005-05-26 04:52:23,2
28,29,2005-05-25 03:47:12,611,44,2005-05-30 00:31:12,2
36,37,2005-05-25 04:44:31,403,535,2005-05-29 01:03:31,1
41,42,2005-05-25 05:24:58,380,523,2005-05-31 02:47:58,2
59,60,2005-05-25 08:58:25,330,470,2005-05-30 14:14:25,1
61,62,2005-05-25 09:18:52,261,419,2005-05-30 10:55:52,1
63,64,2005-05-25 09:21:29,79,368,2005-06-03 11:31:29,1
66,67,2005-05-25 09:41:01,239,119,2005-05-27 13:46:01,2
72,73,2005-05-25 11:00:07,517,391,2005-06-01 13:56:07,2
82,83,2005-05-25 12:30:15,466,131,2005-05-27 15:40:15,1
84,85,2005-05-25 13:05:34,470,414,2005-05-29 16:53:34,1
90,91,2005-05-25 14:57:22,139,267,2005-06-01 18:32:22,1
91,92,2005-05-25 15:38:46,775,302,2005-05-31 13:40:46,2
94,95,2005-05-25 16:12:52,178,400,2005-06-02 18:55:52,2
98,99,2005-05-25 16:50:20,535,44,2005-05-28 18:52:20,1
100,101,2005-05-25 17:17:04,617,468,2005-05-31 19:47:04,1

In [49]:
old_HDD.head()

  first_name last_name                  title  category_id     category
0   Penelope   Guiness       ACADEMY DINOSAUR            6  Documentary
1   Penelope   Guiness   ANACONDA CONFESSIONS            2    Animation
2   Penelope   Guiness            ANGELS LIFE           13          New
3   Penelope   Guiness  BULWORTH COMMANDMENTS           10        Games
4   Penelope   Guiness          CHEAPER CLYDE           14       Sci-Fi

In [50]:
old_HDD.head()

  first_name last_name                  title  category_id     category
0   Penelope   Guiness       ACADEMY DINOSAUR            6  Documentary
1   Penelope   Guiness   ANACONDA CONFESSIONS            2    Animation
2   Penelope   Guiness            ANGELS LIFE           13          New
3   Penelope   Guiness  BULWORTH COMMANDMENTS           10        Games
4   Penelope   Guiness          CHEAPER CLYDE           14       Sci-Fi

In [51]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0
4,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11.0
5,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,English,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6.0
8,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,English,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",NaN
9,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,English,6,2.99,130,22.99,G,Deleted Scenes,NaN

In [72]:
# #vamos a añadir las categorías de cada película a través de old_HDD
old_HDD = old_HDD.merge(film, on='title', how='left')

old_HDD = old_HDD.drop(['title', 'category_id_x', 'category', 'description','language_id', 'rental_duration', 'rental_rate', 'length', 'replacement_cost','rating','special_features','category_id_y'], axis=1)

# #eliminamos los duplicados que hayan podido salir con el join
# old_HDD = old_HDD.drop_duplicates()

In [78]:
old_HDD

    first_name last_name  film_id              name
0     Penelope   Guiness        1  Penelope Guiness
1     Penelope   Guiness       23  Penelope Guiness
2     Penelope   Guiness       25  Penelope Guiness
3     Penelope   Guiness      106  Penelope Guiness
4     Penelope   Guiness      140  Penelope Guiness
..         ...       ...      ...               ...
995     Goldie     Brody      168      Goldie Brody
996     Goldie     Brody      203      Goldie Brody
997     Goldie     Brody      222      Goldie Brody
998     Goldie     Brody      290      Goldie Brody
999     Goldie     Brody      293      Goldie Brody

[1000 rows x 4 columns]

In [74]:
# old_HDD = old_HDD.merge(actor, on='name', how='left')

KeyError: 'name'

In [81]:
old_HDD = old_HDD.drop(['first_name', 'last_name'], axis=1)

In [85]:
# vamos a añadir las categorías de cada película a través de old_HDD
# old_HDD = old_HDD.merge(actor, on='name', how='left')
old_HDD = old_HDD.drop(['name', 'first_name', 'last_name'], axis=1)

# #eliminamos los duplicados que hayan podido salir con el join
# old_HDD = old_HDD.drop_duplicates()

In [86]:
old_HDD

     film_id  actor_id
0          1         1
1         23         1
2         25         1
3        106         1
4        140         1
..       ...       ...
995      168        39
996      203        39
997      222        39
998      290        39
999      293        39

[1000 rows x 2 columns]

In [93]:
old_HDD['id'] = old_HDD.reset_index().index + 1

In [95]:
old_HDD

     film_id  actor_id    id
0          1         1     1
1         23         1     2
2         25         1     3
3        106         1     4
4        140         1     5
..       ...       ...   ...
995      168        39   996
996      203        39   997
997      222        39   998
998      290        39   999
999      293        39  1000

[1000 rows x 3 columns]

In [76]:
old_HDD['name'] = old_HDD['first_name'] + ' ' + old_HDD['last_name']

In [77]:
actor['name'] = actor['first_name'] + ' ' + actor['last_name']

In [60]:
# actor

guardamos los archivos limpios

In [96]:
# actor.to_csv('../data/actor_clean.csv', index=False)
# category.to_csv('../data/category_clean.csv', index=False)
# film.to_csv('../data/film_clean.csv', index=False)
# inventory.to_csv('../data/inventory_clean.csv', index=False)
# language.to_csv('../data/language_clean.csv', index=False)
# old_HDD.to_csv('../data/old_HDD_clean.csv', index=False)
# rental.to_csv('../data/rental_clean.csv', index=False)

In [62]:
# %pip install mysql-connector-python

In [63]:
# %pip install pymysql

In [64]:
# from sqlalchemy import create_engine

In [65]:
# with open("../data/password.txt", "r") as f:
#     password = f.read().strip()

In [66]:
# str_conn = f'mysql+pymysql://root:{password}@127.0.0.1:3306/cinema'
# cursor = create_engine(str_conn)

In [67]:
actor, inventario, categoria, peliculas

NameError: name 'inventario' is not defined